# coding=utf-8

orgs = {"济南农商行": "济南农商行", "章丘": "济南", "平阴": "济南", "济阳": "济南", "商河": "济南", "莱芜农商行": "莱芜农商行", "青岛": "青岛", "张店": "淄博", "临淄": "淄博",
        "博山": "淄博", "周村": "淄博", "桓台": "淄博", "高青": "淄博", "沂源": "淄博", "淄川": "淄博", "枣庄": "枣庄", "滕州": "枣庄", "东营": "东营",
        "垦利": "东营", "利津": "东营", "广饶": "东营", "烟台": "烟台", "龙口": "烟台", "莱阳": "烟台", "莱州": "烟台", "蓬莱": "烟台", "招远": "烟台",
        "栖霞": "烟台", "海阳": "烟台", "长岛": "烟台", "潍坊": "潍坊", "青州": "潍坊", "诸城": "潍坊", "寿光": "潍坊", "安丘": "潍坊", "高密": "潍坊",
        "昌邑": "潍坊", "昌乐": "潍坊", "临朐": "潍坊", "济宁": "济宁", "曲阜": "济宁", "兖州": "济宁", "邹城": "济宁", "汶上": "济宁", "泗水": "济宁",
        "微山": "济宁", "鱼台": "济宁", "金乡": "济宁", "嘉祥": "济宁", "梁山": "济宁", "泰山": "泰安", "岱岳": "泰安", "新泰": "泰安", "肥城": "泰安",
        "宁阳": "泰安", "东平": "泰安", "威海": "威海", "荣成": "威海", "文登": "威海", "乳山": "威海", "东港": "日照", "岚山": "日照", "莒县": "日照",
        "五莲": "日照", "滨州": "滨州", "博兴": "滨州", "邹平": "滨州", "惠民": "滨州", "阳信": "滨州", "无棣": "滨州", "德州": "德州", "乐陵": "德州",
        "禹城": "德州", "陵城": "德州", "宁津": "德州", "庆云": "德州", "临邑": "德州", "齐河": "德州", "平原": "德州", "夏津": "德州", "武城": "德州",
        "聊城": "聊城", "临清": "聊城", "高唐": "聊城", "茌平": "聊城", "东阿": "聊城", "阳谷": "聊城", "莘县": "聊城", "润昌": "聊城", "兰山": "临沂",
        "罗庄": "临沂", "河东": "临沂", "沂南": "临沂", "沂水": "临沂", "莒南": "临沂", "临沭": "临沂", "郯城": "临沂", "兰陵": "临沂", "费县": "临沂",
        "平邑": "临沂", "蒙阴": "临沂", "菏泽": "菏泽", "曹县": "菏泽", "定陶": "菏泽", "成武": "菏泽", "单县": "菏泽", "巨野": "菏泽", "郓城": "菏泽",
        "鄄城": "菏泽", "东明": "菏泽"}
cities = {"济南农商行": {"济南农商行": []},
          "济南": {"章丘": [], "平阴": [], "济阳": [], "商河": []},"莱芜农商行": {"莱芜农商行": []},
          "青岛": {"青岛": []},
          "淄博": {"张店": [], "临淄": [], "博山": [], "周村": [], "桓台": [], "高青": [], "沂源": [], "淄川": []},
          "枣庄": {"枣庄": [], "滕州": []}, "东营": {"东营": [], "垦利": [], "利津": [], "广饶": []},
          "烟台": {"烟台": [], "龙口": [], "莱阳": [], "莱州": [], "蓬莱": [], "招远": [], "栖霞": [], "海阳": [], "长岛": []},
          "潍坊": {"潍坊": [], "青州": [], "诸城": [], "寿光": [], "安丘": [], "高密": [], "昌邑": [], "昌乐": [], "临朐": []},
          "济宁": {"济宁": [], "曲阜": [], "兖州": [], "邹城": [], "汶上": [], "泗水": [], "微山": [], "鱼台": [], "金乡": [], "嘉祥": [],
                 "梁山": []}, "泰安": {"泰山": [], "岱岳": [], "新泰": [], "肥城": [], "宁阳": [], "东平": []},
          "威海": {"威海": [], "荣成": [], "文登": [], "乳山": []}, "日照": {"东港": [], "岚山": [], "莒县": [], "五莲": []},
          "滨州": {"滨州": [], "博兴": [], "邹平": [], "惠民": [], "阳信": [], "无棣": []},
          "德州": {"德州": [], "乐陵": [], "禹城": [], "陵城": [], "宁津": [], "庆云": [], "临邑": [], "齐河": [], "平原": [], "夏津": [],
                 "武城": []}, "聊城": {"聊城": [], "临清": [], "高唐": [], "茌平": [], "东阿": [], "阳谷": [], "莘县": [], "润昌": []},
          "临沂": {"兰山": [], "罗庄": [], "河东": [], "沂南": [], "沂水": [], "莒南": [], "临沭": [], "郯城": [], "兰陵": [], "费县": [],
                 "平邑": [], "蒙阴": []},
          "菏泽": {"菏泽": [], "曹县": [], "定陶": [], "成武": [], "单县": [], "巨野": [], "郓城": [], "鄄城": [], "东明": []}}

city_count = {"济南农商行": {"济南农商行": 0},
              "济南": {"章丘": 0, "平阴": 0, "济阳": 0, "商河": 0}, "莱芜农商行": {"莱芜农商行": 0},
              "青岛": {"青岛": 0},
          "淄博": {"张店": 0, "临淄": 0, "博山": 0, "周村": 0, "桓台": 0, "高青": 0, "沂源": 0, "淄川": 0},
          "枣庄": {"枣庄": 0, "滕州": 0}, "东营": {"东营": 0, "垦利": 0, "利津": 0, "广饶": 0},
          "烟台": {"烟台": 0, "龙口": 0, "莱阳": 0, "莱州": 0, "蓬莱": 0, "招远": 0, "栖霞": 0, "海阳": 0, "长岛": 0},
          "潍坊": {"潍坊": 0, "青州": 0, "诸城": 0, "寿光": 0, "安丘": 0, "高密": 0, "昌邑": 0, "昌乐": 0, "临朐": 0},
          "济宁": {"济宁": 0, "曲阜": 0, "兖州": 0, "邹城": 0, "汶上": 0, "泗水": 0, "微山": 0, "鱼台": 0, "金乡": 0, "嘉祥": 0,
                 "梁山": 0}, "泰安": {"泰山": 0, "岱岳": 0, "新泰": 0, "肥城": 0, "宁阳": 0, "东平": 0},
          "威海": {"威海": 0, "荣成": 0, "文登": 0, "乳山": 0}, "日照": {"东港": 0, "岚山": 0, "莒县": 0, "五莲": 0},
          "滨州": {"滨州": 0, "博兴": 0, "邹平": 0, "惠民": 0, "阳信": 0, "无棣": 0},
          "德州": {"德州": 0, "乐陵": 0, "禹城": 0, "陵城": 0, "宁津": 0, "庆云": 0, "临邑": 0, "齐河": 0, "平原": 0, "夏津": 0,
                 "武城": 0}, "聊城": {"聊城": 0, "临清": 0, "高唐": 0, "茌平": 0, "东阿": 0, "阳谷": 0, "莘县": 0, "润昌": 0},
          "临沂": {"兰山": 0, "罗庄": 0, "河东": 0, "沂南": 0, "沂水": 0, "莒南": 0, "临沭": 0, "郯城": 0, "兰陵": 0, "费县": 0,
                 "平邑": 0, "蒙阴": 0},
          "菏泽": {"菏泽": 0, "曹县": 0, "定陶": 0, "成武": 0, "单县": 0, "巨野": 0, "郓城": 0, "鄄城": 0, "东明": 0}}

format_header = {
        'font_size': '16',
        'bold': 1,
        'border': 1,
        'align': 'center',
        'valign': 'vcenter', }

format_merge = {
        'font_size': '12',
        'bold': 1,
        'border': 1,
        'align': 'center',
        'valign': 'vcenter', }

format_normal = {
        'font_size': '12',
        'border': 1,
        'align': 'center',
        'valign': 'vcenter', }